tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "timothyye/tap"
tap "tldr-pages/tldr"
tap "wkentaro/labelme"
# Search tool like grep, but optimized for programmers
brew "ack"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Parser generator
brew "bison"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Open source suite of directory software
brew "openldap"
# Modern replacement for 'ls'
brew "exa"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Software library to render fonts
brew "freetype"
# GNU compiler collection
brew "gcc"
# GNU compiler collection
brew "gcc@6"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Multi-platform library for OpenGL applications
brew "glfw"
# Interpreted, interactive, object-oriented programming language
brew "python"
# C++ mathematics library for graphics software
brew "glm"
# Add GitHub support to git on the command-line
brew "hub"
# Conversion library
brew "libiconv"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based UI library
brew "ncurses"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage compile and link flags for libraries
brew "pkg-config"
# Advanced filtering web proxy
brew "privoxy"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# x86 and PowerPC Emulator
brew "qemu"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Interactive cheatsheet tool for the command-line
brew "denisidoro/tools/navi"
# Yet another command-line dictionary for geeks!
brew "timothyye/tap/ydict"
# Simplified and community-driven man pages
brew "tldr-pages/tldr/tldr"
# Keep your application settings in sync (OS X/Linux)
brew "mackup"
brew "node"
cask "aria2gui"
cask "cheatsheet"
cask "crunch"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "gcc-arm-embedded"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "qq"
cask "snipaste"
cask "spotify"
cask "sublime-text"
cask "wkentaro/labelme/labelme"
cask "evernote"
